cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/drivers'

brew 'coreutils'
brew 'bash-completion'
brew 'ack'
brew 'grc'
brew 'jq'
brew 'jp2a'
brew 'git'

brew 'openssl'
brew 'readline'
brew 'tmux'
brew 'screen'
brew 'wget'

brew 'node'
brew 'postgresql'

brew 'ruby-build'
brew 'rbenv'
brew 'go'
brew 'python'
brew 'python3'

# macOS app store manual installs
#  apple configurator
#  hyperdock (due to licensing)
#  soulver
#  photosweeper
#  the unarchiver

# other manul installs
#   canon printer/scanner drivers and software
#   encfs & encfsGUI

cask '1password'
cask 'dashlane'
cask 'tunnelblick'
cask 'teamviewer'
cask 'google-chrome'
cask 'google-backup-and-sync' # google-drive
cask 'microsoft-office'
cask 'slack'
cask 'skype'
cask 'evernote'
cask 'dropbox'
cask 'quik'
cask 'xquartz'
cask 'inkscape'

cask 'airdisplay'
cask 'airfoil'
cask 'logitech-myharmony'

cask 'osxfuse'
cask 'insomniax'
cask 'disk-inventory-x'
cask 'crashplan'

cask 'virtualbox'
cask 'docker'
cask 'macvim'
cask 'atom'
cask 'transmission'
